07_rails/copro/app/controllers/comments_controller.rb

	def create
		comment = Comment.new
		comment.body = params[:comment_text]
		comment.user_id = session[:user_id]
		comment.project_id = params[:project_id]

		if comment.save
---
INSERT INTO "comments" ("text", "user_id", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "nice pudding"], ["user_id", 3], ["created_at", "2018-01-24 05:37:54.328476"], ["updated_at", "2018-01-24 05:37:54.328476"], ["project_id", 47]]