07_rails/copro/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["project_id", 47], ["created_at", "2018-01-25 03:29:41.985065"], ["updated_at", "2018-01-25 03:29:41.985065"]]
---
	def create
		like = Like.new
		like.user_id = session[:user_id]
		like.project_id = params[:project_id]

		if like.save