07_rails/copro/app/controllers/projects_controller.rb

	def create
		redirect_to '/login' unless session[:user_id]

		project = Project.new
		project.title = params[:title]
		project.user_id = session[:user_id]
		project.preview = params[:preview]

		if project.save
---
INSERT INTO "projects" ("title", "user_id", "created_at", "updated_at", "preview") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "pudding 2"], ["user_id", 3], ["created_at", "2018-01-24 01:37:44.670070"], ["updated_at", "2018-01-24 01:37:44.670070"], ["preview", "Japanese-Pudding-II-600x900.jpg"]]