07_rails/goodfoodhunting/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "lunch"], ["dish_id", 12], ["created_at", "2018-02-01 02:02:08.817904"], ["updated_at", "2018-02-01 02:02:08.817904"]]
---
	def api_create
		comment = Comment.new
		comment.content = params[:content]
		comment.dish_id = params[:dish_id]
		comment.save