07_rails/goodfoodhunting/app/controllers/dishes_controller.rb

	def index
		@dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

	def create
		new_dish = Dish.new
		new_dish.name = params[:dish_name]
		new_dish.image_url = params[:image_url]
		new_dish.save
---
INSERT INTO "dishes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-01-22 07:53:12.417639"], ["updated_at", "2018-01-22 07:53:12.417639"]]

	def show
		@dish = Dish.find_by(id: params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		dish = Dish.find(params[:id])
		dish.name = params[:new_name]
		dish.image_url = params[:new_image_url]
		dish.save
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "dishes" SET "image_url" = $1, "updated_at" = $2 WHERE "dishes"."id" = $3  [["image_url", "https://www.justonecookbook.com/wp-content/uploads/2016/09/Japanese-Pudding-II-600x900.jpg"], ["updated_at", "2018-01-22 08:31:56.941924"], ["id", 18]]

	def destroy
		@dish = Dish.find(params[:id])
		if @dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 19]]

	def api_index
		@dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"