07_rails/copro/app/views/projects/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."project_id" = $1  [["project_id", 47]]
---
		<input type="hidden" name="project_id" value="<%= @project.id %>">
		<span class="like-count"><%= @project.likes.count %></span>